- everything is essentially a character

## Letters
- abc... Letters

In [2]:
import pandas as pd

In [24]:
text = ['abcdefg', 'abcde', 'abc']
df = pd.DataFrame(text, columns = ['text'])
df

      text
0  abcdefg
1    abcde
2      abc

In [32]:
df.text.str.extract(r'(a)')

   0
0  a
1  a
2  a

## Digits
- 123... Digits
- \d Any digit
- \D Any non-digit character

In [70]:
digits = ['abc123xyz', 'define "123"', 'var g = 123']
df = pd.DataFrame(digits, columns = ['digits'])
df

         digits
0     abc123xyz
1  define "123"
2   var g = 123

In [71]:
df.digits.str.extract(r'(\d)')

   0
0  1
1  1
2  1

In [72]:
df.digits.str.extract(r'(\d\d)')

    0
0  12
1  12
2  12

In [73]:
df.digits.str.extract(r'(\d\d\d)')

     0
0  123
1  123
2  123

## Any character and period
- . Any character

In [74]:
text = ['cat.', '896.', '?=+.', 'abc1']
df = pd.DataFrame(text, columns = ['text'])
df

   text
0  cat.
1  896.
2  ?=+.
3  abc1

In [75]:
# Match period only
df.text.str.extract(r'(\.)')

     0
0    .
1    .
2    .
3  NaN

## Only a, b or c
- [abc] only matches single a, b or c and nothing else

In [59]:
text = ['can', 'man', 'fan', 'dan', 'ran', 'pan']
df = pd.DataFrame(text, columns = ['text'])
df

  text
0  can
1  man
2  fan
3  dan
4  ran
5  pan

In [61]:
df.text.str.extract(r'([a])')

   0
0  a
1  a
2  a
3  a
4  a
5  a

In [62]:
df.text.str.extract(r'([cmf])')

     0
0    c
1    m
2    f
3  NaN
4  NaN
5  NaN

## Excluding specific characters
- [^abc] matches any single character except for a, b or c

In [63]:
text = ['hog', 'dog', 'bog']
df = pd.DataFrame(text, columns = ['text'])
df

  text
0  hog
1  dog
2  bog

In [65]:
df.text.str.extract(r'([^bog])')

     0
0    h
1    d
2  NaN

In [66]:
df.text.str.extract(r'([hd])')

     0
0    h
1    d
2  NaN

## Character ranges
- [a-z] Characters a to z
- [0-9] Numbers 0 to 9
- \w Any alphanumeric character
- \W Any non-alphanumeric character

In [77]:
text = ['Ana', 'Bob', 'Cpc', 'aax', 'bby', 'ccz']
df = pd.DataFrame(text, columns = ['text'])
df

  text
0  Ana
1  Bob
2  Cpc
3  aax
4  bby
5  ccz

In [78]:
# Match only Ana, Bob and Cpc
df.text.str.extract(r'([A-Z])')

     0
0    A
1    B
2    C
3  NaN
4  NaN
5  NaN

In [79]:
df.text.str.extract(r'([A-Z][a-z])')

     0
0   An
1   Bo
2   Cp
3  NaN
4  NaN
5  NaN

In [80]:
df.text.str.extract(r'([A-Z][a-z][a-z])')

     0
0  Ana
1  Bob
2  Cpc
3  NaN
4  NaN
5  NaN

## Repetitions
- {m} m Repetitions
- {m, n} m to n Repetitions

In [83]:
text = ['wazzzzzzup', 'wazzzup', 'wazup']
df = pd.DataFrame(text, columns = ['text'])
df

         text
0  wazzzzzzup
1     wazzzup
2       wazup

In [84]:
# Match z exactly 3 times
df.text.str.extract(r'(z{3})')

     0
0  zzz
1  zzz
2  NaN

In [87]:
# Match z exactly once
df.text.str.extract(r'(z{1})')

   0
0  z
1  z
2  z

In [88]:
# Match z between 3 to 6 times inclusive
df.text.str.extract(r'(z{3,6})')

        0
0  zzzzzz
1     zzz
2     NaN

## Zero or more repetitions
- (.*) Zero or more repetitions
- (+) One or more repetitions

In [89]:
text = ['aaaabcc', 'aabbbbc', 'aacc', 'a']
df = pd.DataFrame(text, columns = ['text'])
df

      text
0  aaaabcc
1  aabbbbc
2     aacc
3        a

In [93]:
# match one or more c's
df.text.str.extract(r'(c+)')

     0
0   cc
1    c
2   cc
3  NaN

In [97]:
# match zero or more of any character
df.text.str.extract(r'(c.*)')

     0
0   cc
1    c
2   cc
3  NaN

In [98]:
df.text.str.extract(r'(b+)')

      0
0     b
1  bbbb
2   NaN
3   NaN

In [99]:
df.text.str.extract(r'(b.*)')

       0
0    bcc
1  bbbbc
2    NaN
3    NaN

## Optional character
- ? Optional character
- ab?c matches either 'abc' or 'ac' because the 'b' is optional

In [101]:
text = ['1 file found?', ' 2 files found?', '24 files found?', 'No files found.']
df = pd.DataFrame(text, columns = ['text'])
df

              text
0    1 file found?
1   2 files found?
2  24 files found?
3  No files found.

In [104]:
# match only found?
df.text.str.extract(r'(found\?)')

        0
0  found?
1  found?
2  found?
3     NaN

## Whitespace
- \s Any whitespace
- \S Any non-whitespace character
- ( ) space
- \t tab
- \n new line
- \r carriage return (useful in Windows environments)

In [105]:
text = ['1. abc', '2.   abc', '3.      abc', '4.abc']
df = pd.DataFrame(text, columns = ['text'])
df

          text
0       1. abc
1     2.   abc
2  3.      abc
3        4.abc

In [112]:
# match only text with whitespace
df.text.str.extract(r'(\s)')

     0
0
1
2
3  NaN

## Starting and ending
- ^...$ Starts and ends

In [113]:
text = ['Mission: successful', 'Last Mission: unsuccessful', 'Next Mission: successful upon capture of target']
df = pd.DataFrame(text, columns = ['text'])
df

                                              text
0                              Mission: successful
1                       Last Mission: unsuccessful
2  Next Mission: successful upon capture of target

In [115]:
# match only Mission: successful
df.text.str.extract(r'(^Mission: successful$)')

                     0
0  Mission: successful
1                  NaN
2                  NaN

## Match groups
- ^(IMG\d+\.png)$ to capture and extract full filename

- ^(IMG\d+)\.png$ to capture only the part before the period

In [116]:
text = ['file_record_transcript.pdf', 'file_07241999.pdf', 'testfile_fake.pdf.tmp']
df = pd.DataFrame(text, columns = ['text'])
df

                         text
0  file_record_transcript.pdf
1           file_07241999.pdf
2       testfile_fake.pdf.tmp

In [117]:
df.text.str.extract(r'(file_.+\.)')

                         0
0  file_record_transcript.
1           file_07241999.
2           file_fake.pdf.

In [118]:
df.text.str.extract(r'(^(file_.+)\.pdf$)')

                            0                       1
0  file_record_transcript.pdf  file_record_transcript
1           file_07241999.pdf           file_07241999
2                         NaN                     NaN

## Nested group
- ^(IMG(\d+))\.png$

In [121]:
text = ['Jan 1987', 'May 1969', 'Aug 2011']
df = pd.DataFrame(text, columns = ['text'])
df

       text
0  Jan 1987
1  May 1969
2  Aug 2011

In [125]:
df.text.str.extract(r'^(.+\s(\d+))$')

          0     1
0  Jan 1987  1987
1  May 1969  1969
2  Aug 2011  2011

In [126]:
df.text.str.extract(r'^(....(\d+))$')

          0     1
0  Jan 1987  1987
1  May 1969  1969
2  Aug 2011  2011

## More group work

In [127]:
text = ['1280x720', '1920x1600', '1024x768']
df = pd.DataFrame(text, columns = ['text'])
df

        text
0   1280x720
1  1920x1600
2   1024x768

In [128]:
df.text.str.extract(r'(\d+)x(\d+)')

      0     1
0  1280   720
1  1920  1600
2  1024   768

In [131]:
df.text.str.extract(r'(\d*)x(\d*)')

      0     1
0  1280   720
1  1920  1600
2  1024   768

## Conditional
- 'Buy more (milk|bread|juice)' to mathc only the strings 'Buy more milk', 'Buy more bread', 'Buy more juice'

In [132]:
text = ['I love cats', 'I love dogs', 'I love logs', 'I love cogs']
df = pd.DataFrame(text, columns = ['text'])
df

          text
0  I love cats
1  I love dogs
2  I love logs
3  I love cogs

In [133]:
df.text.str.extract(r'I love (cats|dogs)')

      0
0  cats
1  dogs
2   NaN
3   NaN

## Capturing groups

#### example abc, ac

In [19]:
text = ['abc', 'ac']
df = pd.DataFrame(text, columns = ['text'])
df

  text
0  abc
1   ac

In [21]:
df.text.str.extract(r'(a(?=b))')

     0
0    a
1  NaN

In [22]:
df.text.str.extract(r'(a(?!b))')

     0
0  NaN
1    a

In [29]:
df.text.str.extract(r'(a(?:b))')

     0
0   ab
1  NaN

In [24]:
df.text.str.extract(r'(a(b))')

     0    1
0   ab    b
1  NaN  NaN

In [30]:
df.text.str.extract(r'(ab)')

     0
0   ab
1  NaN